valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/pressure_control_config.c
/*
 * Pressure Control Configuration and Calibration Implementation
 * Valeh Injection System - Configuration Management
 * 
 * This file implements all configuration management, calibration,
 * and parameter tuning functions for the pressure control system.
 */

#include "pressure_control_config.h"
#include "advanced_pressure_control.h"
#include "ILI9341_FSMC.h"
#include "main.h"
#include <stdio.h>
#include <string.h>
#include <math.h>
#include "stm32f4xx_hal.h"

/* =========================================================================
   GLOBAL CONFIGURATION VARIABLES
   ========================================================================= */

System_Config_t g_system_config = {
    .system_name = CONFIG_SYSTEM_NAME,
    .version = CONFIG_VERSION,
    .build_date = CONFIG_BUILD_DATE,
    .debug_enabled = true,
    .safety_enabled = true,
    .auto_mode_enabled = false
};

PID_Tuning_t g_pid_zme_tuning = {
    .kp = CONFIG_PID_ZME_KP_DEFAULT,
    .ki = CONFIG_PID_ZME_KI_DEFAULT,
    .kd = CONFIG_PID_ZME_KD_DEFAULT,
    .auto_tune_enabled = false,
    .tuning_aggressiveness = 1.0f
};

PID_Tuning_t g_pid_drv_tuning = {
    .kp = CONFIG_PID_DRV_KP_DEFAULT,
    .ki = CONFIG_PID_DRV_KI_DEFAULT,
    .kd = CONFIG_PID_DRV_KD_DEFAULT,
    .auto_tune_enabled = false,
    .tuning_aggressiveness = 1.0f
};

Calibration_Data_t g_calibration_data = {
    .adc_min = CONFIG_PRESSURE_SENSOR_ADC_MIN,
    .adc_max = CONFIG_PRESSURE_SENSOR_ADC_MAX,
    .pressure_min = CONFIG_PRESSURE_SENSOR_PRESSURE_MIN,
    .pressure_max = CONFIG_PRESSURE_SENSOR_PRESSURE_MAX,
    .slope = 0.0f,
    .offset = 0.0f,
    .calibrated = false,
    .calibration_date = 0
};

Valve_Config_t g_valve_config = {
    .zme_pwm_min = CONFIG_ZME_PWM_MIN,
    .zme_pwm_max = CONFIG_ZME_PWM_MAX,
    .zme_cutoff_pwm = CONFIG_ZME_CUTOFF_PWM,
    .zme_min_working = CONFIG_ZME_MIN_WORKING,
    .drv_pwm_min = CONFIG_DRV_PWM_MIN,
    .drv_pwm_max = CONFIG_DRV_PWM_MAX,
    .motor_pwm_min = CONFIG_MOTOR_PWM_MIN,
    .motor_pwm_max = CONFIG_MOTOR_PWM_MAX
};

Safety_Config_t g_safety_config = {
    .max_pressure = CONFIG_SAFETY_MAX_PRESSURE,
    .over_limit_margin = CONFIG_SAFETY_OVER_LIMIT_MARGIN,
    .emergency_threshold = CONFIG_SAFETY_EMERGENCY_THRESHOLD,
    .safety_enabled = true
};

/* =========================================================================
   CONFIGURATION MANAGEMENT FUNCTIONS
   ========================================================================= */

/**
 * @brief Initialize configuration system
 */
void PressureControlConfig_Init(void) {
    printf("Pressure Control Configuration - Initializing...\r\n");
    
    // Load configuration from flash
    PressureControlConfig_LoadFromFlash();
    
    // Load PID parameters and SP from flash (important - must be called early)
    PressureControlConfig_LoadPIDParams();
    
    // Apply PID tuning parameters to AdvancedPressureControl system
    // This ensures that g_pid_zme_tuning and g_pid_drv_tuning values are applied
    // even if flash loading didn't happen or returned early
    PressureControlConfig_SetPIDTuning(&g_pid_zme_tuning, 
                                       g_pid_zme_tuning.kp, 
                                       g_pid_zme_tuning.ki, 
                                       g_pid_zme_tuning.kd);
    PressureControlConfig_SetPIDTuning(&g_pid_drv_tuning, 
                                       g_pid_drv_tuning.kp, 
                                       g_pid_drv_tuning.ki, 
                                       g_pid_drv_tuning.kd);
    
    // Calculate calibration slope
    if (g_calibration_data.calibrated) {
        g_calibration_data.slope = (g_calibration_data.pressure_max - g_calibration_data.pressure_min) / 
                                  (g_calibration_data.adc_max - g_calibration_data.adc_min);
        g_calibration_data.offset = g_calibration_data.pressure_min - 
                                   (g_calibration_data.slope * g_calibration_data.adc_min);
    }
    
    printf("Configuration initialized successfully\r\n");
    PressureControlConfig_PrintSystemInfo();
}

/**
 * @brief Load default configuration
 */
void PressureControlConfig_LoadDefaults(void) {
    printf("Loading default configuration...\r\n");
    
    // Reset all configurations to defaults
    g_pid_zme_tuning.kp = CONFIG_PID_ZME_KP_DEFAULT;
    g_pid_zme_tuning.ki = CONFIG_PID_ZME_KI_DEFAULT;
    g_pid_zme_tuning.kd = CONFIG_PID_ZME_KD_DEFAULT;
    
    g_pid_drv_tuning.kp = CONFIG_PID_DRV_KP_DEFAULT;
    g_pid_drv_tuning.ki = CONFIG_PID_DRV_KI_DEFAULT;
    g_pid_drv_tuning.kd = CONFIG_PID_DRV_KD_DEFAULT;
    
    // Apply default PID tuning values to AdvancedPressureControl system
    PressureControlConfig_SetPIDTuning(&g_pid_zme_tuning, 
                                       g_pid_zme_tuning.kp, 
                                       g_pid_zme_tuning.ki, 
                                       g_pid_zme_tuning.kd);
    PressureControlConfig_SetPIDTuning(&g_pid_drv_tuning, 
                                       g_pid_drv_tuning.kp, 
                                       g_pid_drv_tuning.ki, 
                                       g_pid_drv_tuning.kd);
    
    g_safety_config.max_pressure = CONFIG_SAFETY_MAX_PRESSURE;
    g_safety_config.over_limit_margin = CONFIG_SAFETY_OVER_LIMIT_MARGIN;
    g_safety_config.emergency_threshold = CONFIG_SAFETY_EMERGENCY_THRESHOLD;
    
    g_valve_config.zme_pwm_min = CONFIG_ZME_PWM_MIN;
    g_valve_config.zme_pwm_max = CONFIG_ZME_PWM_MAX;
    g_valve_config.zme_cutoff_pwm = CONFIG_ZME_CUTOFF_PWM;
    
    printf("Default configuration loaded\r\n");
}

/**
 * @brief Save configuration to flash memory
 */
void PressureControlConfig_SaveToFlash(void) {
    printf("Saving system configuration to flash...\r\n");
    
    // Save all configuration data
    PressureControlConfig_SavePIDParams();
    PressureControlConfig_SaveCalibrationData();
    
    printf("System configuration saved to flash memory\r\n");
}

/**
 * @brief Load configuration from flash memory
 */
void PressureControlConfig_LoadFromFlash(void) {
    printf("Loading system configuration from flash...\r\n");
    
