valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/pressure_control_config.c
    // Load all configuration data
    PressureControlConfig_LoadPIDParams();
    PressureControlConfig_LoadCalibrationData();
    
    printf("System configuration loaded from flash memory\r\n");
}

/* =========================================================================
   PID TUNING FUNCTIONS
   ========================================================================= */

/**
 * @brief Set PID tuning parameters
 */
void PressureControlConfig_SetPIDTuning(PID_Tuning_t* tuning, float kp, float ki, float kd) {
    if (PressureControlConfig_ValidatePIDParams(kp, ki, kd)) {
        tuning->kp = kp;
        tuning->ki = ki;
        tuning->kd = kd;
        
        // Apply to active PID controllers
        if (tuning == &g_pid_zme_tuning) {
            AdvancedPressureControl_SetPIDParams(&g_pid_zme, kp, ki, kd);
        } else if (tuning == &g_pid_drv_tuning) {
            AdvancedPressureControl_SetPIDParams(&g_pid_drv, kp, ki, kd);
        }
        
        printf("PID tuning updated: Kp=%.3f, Ki=%.3f, Kd=%.3f\r\n", kp, ki, kd);
    } else {
        printf("Invalid PID parameters: Kp=%.3f, Ki=%.3f, Kd=%.3f\r\n", kp, ki, kd);
    }
}

/**
 * @brief Enable/disable auto-tuning
 */
void PressureControlConfig_EnableAutoTune(PID_Tuning_t* tuning, bool enable) {
    tuning->auto_tune_enabled = enable;
    printf("Auto-tuning %s for PID controller\r\n", enable ? "enabled" : "disabled");
}

/**
 * @brief Set tuning aggressiveness
 */
void PressureControlConfig_SetTuningAggressiveness(PID_Tuning_t* tuning, float aggressiveness) {
    tuning->tuning_aggressiveness = fmaxf(0.1f, fminf(2.0f, aggressiveness));
    printf("Tuning aggressiveness set to %.2f\r\n", tuning->tuning_aggressiveness);
}

/**
 * @brief Reset PID tuning to defaults
 */
void PressureControlConfig_ResetPIDTuning(PID_Tuning_t* tuning) {
    if (tuning == &g_pid_zme_tuning) {
        tuning->kp = CONFIG_PID_ZME_KP_DEFAULT;
        tuning->ki = CONFIG_PID_ZME_KI_DEFAULT;
        tuning->kd = CONFIG_PID_ZME_KD_DEFAULT;
    } else if (tuning == &g_pid_drv_tuning) {
        tuning->kp = CONFIG_PID_DRV_KP_DEFAULT;
        tuning->ki = CONFIG_PID_DRV_KI_DEFAULT;
        tuning->kd = CONFIG_PID_DRV_KD_DEFAULT;
    }
    
    // Apply reset values to AdvancedPressureControl system
    PressureControlConfig_SetPIDTuning(tuning, tuning->kp, tuning->ki, tuning->kd);
    
    printf("PID tuning reset to defaults\r\n");
}

/* =========================================================================
   CALIBRATION FUNCTIONS
   ========================================================================= */

/**
 * @brief Start calibration process
 */
void PressureControlConfig_StartCalibration(void) {
    printf("Starting pressure sensor calibration...\r\n");
    printf("Please ensure pressure sensor is at 0 bar (atmospheric pressure)\r\n");
    
    g_calibration_data.calibrated = false;
    g_calibration_data.calibration_date = HAL_GetTick();
}

/**
 * @brief Add calibration point
 */
void PressureControlConfig_AddCalibrationPoint(float adc_value, float pressure_value) {
    printf("Calibration point added: ADC=%.0f, Pressure=%.2f bar\r\n", adc_value, pressure_value);
    
    // Update calibration data
    if (pressure_value == 0.0f) {
        g_calibration_data.adc_min = adc_value;
        g_calibration_data.pressure_min = pressure_value;
    } else {
        g_calibration_data.adc_max = adc_value;
        g_calibration_data.pressure_max = pressure_value;
    }
}

/**
 * @brief Complete calibration process
 */
void PressureControlConfig_CompleteCalibration(void) {
    if (g_calibration_data.adc_min > 0 && g_calibration_data.adc_max > g_calibration_data.adc_min) {
        // Calculate slope and offset
        g_calibration_data.slope = (g_calibration_data.pressure_max - g_calibration_data.pressure_min) / 
                                  (g_calibration_data.adc_max - g_calibration_data.adc_min);
        g_calibration_data.offset = g_calibration_data.pressure_min - 
                                   (g_calibration_data.slope * g_calibration_data.adc_min);
        g_calibration_data.calibrated = true;
        
        printf("Calibration completed successfully\r\n");
        PressureControlConfig_PrintCalibrationData();
        
        // Save calibration data
        PressureControlConfig_SaveCalibrationData();
    } else {
        printf("Calibration failed: Invalid data points\r\n");
    }
}

/**
 * @brief Reset calibration data
 */
void PressureControlConfig_ResetCalibration(void) {
    g_calibration_data.calibrated = false;
    g_calibration_data.slope = 0.0f;
    g_calibration_data.offset = 0.0f;
    printf("Calibration data reset\r\n");
}

/**
 * @brief Check if system is calibrated
 */
bool PressureControlConfig_IsCalibrated(void) {
    return g_calibration_data.calibrated;
}

/**
 * @brief Print calibration data
 */
void PressureControlConfig_PrintCalibrationData(void) {
    printf("\n=== Calibration Data ===\r\n");
    printf("ADC Min: %.0f\r\n", g_calibration_data.adc_min);
    printf("ADC Max: %.0f\r\n", g_calibration_data.adc_max);
    printf("Pressure Min: %.2f bar\r\n", g_calibration_data.pressure_min);
    printf("Pressure Max: %.2f bar\r\n", g_calibration_data.pressure_max);
    printf("Slope: %.6f bar/ADC\r\n", g_calibration_data.slope);
    printf("Offset: %.2f bar\r\n", g_calibration_data.offset);
    printf("Calibrated: %s\r\n", g_calibration_data.calibrated ? "Yes" : "No");
    printf("=======================\r\n\n");
}

/* =========================================================================
   VALVE CONFIGURATION FUNCTIONS
   ========================================================================= */

/**
 * @brief Set valve limits
 */
void PressureControlConfig_SetValveLimits(Valve_Config_t* config) {
    g_valve_config = *config;
    printf("Valve limits updated\r\n");
}

/**
 * @brief Set ZME valve limits
 */
void PressureControlConfig_SetZMELimits(float pwm_min, float pwm_max, float cutoff_pwm) {
    g_valve_config.zme_pwm_min = pwm_min;
    g_valve_config.zme_pwm_max = pwm_max;
    g_valve_config.zme_cutoff_pwm = cutoff_pwm;
    printf("ZME limits: Min=%.1f%%, Max=%.1f%%, Cutoff=%.1f%%\r\n", pwm_min, pwm_max, cutoff_pwm);
}

/**
 * @brief Set DRV valve limits
 */
void PressureControlConfig_SetDRVLimits(float pwm_min, float pwm_max) {
    g_valve_config.drv_pwm_min = pwm_min;
    g_valve_config.drv_pwm_max = pwm_max;
    printf("DRV limits: Min=%.1f%%, Max=%.1f%%\r\n", pwm_min, pwm_max);
}

/**
 * @brief Set motor limits
 */
void PressureControlConfig_SetMotorLimits(float pwm_min, float pwm_max) {
    g_valve_config.motor_pwm_min = pwm_min;
    g_valve_config.motor_pwm_max = pwm_max;
    printf("Motor limits: Min=%.1f%%, Max=%.1f%%\r\n", pwm_min, pwm_max);
}

/* =========================================================================
   SAFETY CONFIGURATION FUNCTIONS
   ========================================================================= */

/**
 * @brief Set safety limits
 */
void PressureControlConfig_SetSafetyLimits(float max_pressure, float over_limit_margin, float emergency_threshold) {
    g_safety_config.max_pressure = max_pressure;
    g_safety_config.over_limit_margin = over_limit_margin;
    g_safety_config.emergency_threshold = emergency_threshold;
    printf("Safety limits: Max=%.1f bar, Over-limit=%.1f bar, Emergency=%.1f bar\r\n", 
           max_pressure, over_limit_margin, emergency_threshold);
}

/**
 * @brief Enable/disable safety system
 */
void PressureControlConfig_EnableSafety(bool enable) {
    g_safety_config.safety_enabled = enable;
    printf("Safety system %s\r\n", enable ? "enabled" : "disabled");
}

/* =========================================================================
   SYSTEM CONFIGURATION FUNCTIONS
   ========================================================================= */

/**
 * @brief Set debug mode
 */
void PressureControlConfig_SetDebugMode(bool enable) {
    g_system_config.debug_enabled = enable;
    printf("Debug mode %s\r\n", enable ? "enabled" : "disabled");
}

/**
 * @brief Set auto mode
 */
void PressureControlConfig_SetAutoMode(bool enable) {
    g_system_config.auto_mode_enabled = enable;
    printf("Auto mode %s\r\n", enable ? "enabled" : "disabled");
}

/**
 * @brief Print system information
 */
void PressureControlConfig_PrintSystemInfo(void) {
    printf("\n=== System Information ===\r\n");
    printf("System: %s\r\n", g_system_config.system_name);
    printf("Version: %s\r\n", g_system_config.version);
    printf("Build Date: %s\r\n", g_system_config.build_date);
    printf("Debug Mode: %s\r\n", g_system_config.debug_enabled ? "Enabled" : "Disabled");
    printf("Safety System: %s\r\n", g_system_config.safety_enabled ? "Enabled" : "Disabled");
    printf("Auto Mode: %s\r\n", g_system_config.auto_mode_enabled ? "Enabled" : "Disabled");
    printf("==========================\r\n\n");
}

/* =========================================================================
   PARAMETER VALIDATION FUNCTIONS
   ========================================================================= */

/**
 * @brief Validate PID parameters
 */
bool PressureControlConfig_ValidatePIDParams(float kp, float ki, float kd) {
    return (kp >= 0.0f && kp <= 100.0f) &&
           (ki >= 0.0f && ki <= 10.0f) &&
           (kd >= 0.0f && kd <= 10.0f);
}

/**
 * @brief Validate pressure limits
 */
bool PressureControlConfig_ValidatePressureLimits(float min_pressure, float max_pressure) {
    return (min_pressure >= 0.0f) && 
           (max_pressure > min_pressure) && 
           (max_pressure <= 500.0f);
}

/**
 * @brief Validate PWM values
 */
bool PressureControlConfig_ValidatePWMValues(float pwm_min, float pwm_max) {
    return (pwm_min >= 0.0f) && 
           (pwm_max > pwm_min) && 
           (pwm_max <= 100.0f);
}

/* =========================================================================
   REAL-TIME PARAMETER ADJUSTMENT FUNCTIONS
   ========================================================================= */

/**
 * @brief Adjust Kp parameter
 */
void PressureControlConfig_AdjustKP(float delta) {
    float new_kp = g_pid_zme_tuning.kp + delta;
    if (PressureControlConfig_ValidatePIDParams(new_kp, g_pid_zme_tuning.ki, g_pid_zme_tuning.kd)) {
        PressureControlConfig_SetPIDTuning(&g_pid_zme_tuning, new_kp, g_pid_zme_tuning.ki, g_pid_zme_tuning.kd);
    }
}

/**
 * @brief Adjust Ki parameter
 */
void PressureControlConfig_AdjustKI(float delta) {
    float new_ki = g_pid_zme_tuning.ki + delta;
    if (PressureControlConfig_ValidatePIDParams(g_pid_zme_tuning.kp, new_ki, g_pid_zme_tuning.kd)) {
        PressureControlConfig_SetPIDTuning(&g_pid_zme_tuning, g_pid_zme_tuning.kp, new_ki, g_pid_zme_tuning.kd);
    }
}

/**
 * @brief Adjust Kd parameter
 */
void PressureControlConfig_AdjustKD(float delta) {
    float new_kd = g_pid_zme_tuning.kd + delta;
    if (PressureControlConfig_ValidatePIDParams(g_pid_zme_tuning.kp, g_pid_zme_tuning.ki, new_kd)) {
        PressureControlConfig_SetPIDTuning(&g_pid_zme_tuning, g_pid_zme_tuning.kp, g_pid_zme_tuning.ki, new_kd);
    }
}

/**
 * @brief Adjust target pressure
 */
void PressureControlConfig_AdjustTargetPressure(float delta) {
    SystemStatus_t* status = AdvancedPressureControl_GetStatus();
    float new_pressure = status->target_pressure + delta;
    if (new_pressure >= 0.0f && new_pressure <= 300.0f) {
        AdvancedPressureControl_SetTargetPressure(new_pressure);
    }
}

/* =========================================================================
   STATUS AND MONITORING FUNCTIONS
   ========================================================================= */

/**
 * @brief Print current configuration
 */
void PressureControlConfig_PrintCurrentConfig(void) {
    printf("\n=== Current Configuration ===\r\n");
    printf("ZME PID: Kp=%.3f, Ki=%.3f, Kd=%.3f\r\n", 
           g_pid_zme_tuning.kp, g_pid_zme_tuning.ki, g_pid_zme_tuning.kd);
    printf("DRV PID: Kp=%.3f, Ki=%.3f, Kd=%.3f\r\n", 
           g_pid_drv_tuning.kp, g_pid_drv_tuning.ki, g_pid_drv_tuning.kd);
    printf("Safety: Max=%.1f bar, Over-limit=%.1f bar\r\n", 
           g_safety_config.max_pressure, g_safety_config.over_limit_margin);
    printf("ZME Limits: %.1f%% - %.1f%%, Cutoff=%.1f%%\r\n", 
           g_valve_config.zme_pwm_min, g_valve_config.zme_pwm_max, g_valve_config.zme_cutoff_pwm);
    printf("DRV Limits: %.1f%% - %.1f%%\r\n", 
           g_valve_config.drv_pwm_min, g_valve_config.drv_pwm_max);
    printf("Motor Limits: %.1f%% - %.1f%%\r\n", 
           g_valve_config.motor_pwm_min, g_valve_config.motor_pwm_max);
    printf("=============================\r\n\n");
}

/**
 * @brief Print tuning status
 */
void PressureControlConfig_PrintTuningStatus(void) {
    printf("\n=== PID Tuning Status ===\r\n");
    printf("ZME Auto-tune: %s\r\n", g_pid_zme_tuning.auto_tune_enabled ? "Active" : "Inactive");
    printf("DRV Auto-tune: %s\r\n", g_pid_drv_tuning.auto_tune_enabled ? "Active" : "Inactive");
    printf("ZME Aggressiveness: %.2f\r\n", g_pid_zme_tuning.tuning_aggressiveness);
    printf("DRV Aggressiveness: %.2f\r\n", g_pid_drv_tuning.tuning_aggressiveness);
    printf("=========================\r\n\n");
}

/**
 * @brief Print calibration status
 */
void PressureControlConfig_PrintCalibrationStatus(void) {
    printf("\n=== Calibration Status ===\r\n");
    printf("Calibrated: %s\r\n", g_calibration_data.calibrated ? "Yes" : "No");
    if (g_calibration_data.calibrated) {
        printf("ADC Range: %.0f - %.0f\r\n", g_calibration_data.adc_min, g_calibration_data.adc_max);
        printf("Pressure Range: %.2f - %.2f bar\r\n", g_calibration_data.pressure_min, g_calibration_data.pressure_max);
        printf("Slope: %.6f bar/ADC\r\n", g_calibration_data.slope);
    }
    printf("==========================\r\n\n");
}

/* =========================================================================
   CONFIGURATION PERSISTENCE FUNCTIONS
   ========================================================================= */

