valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/pressure_control_config.c
    // Apply PID parameters to Advanced system controllers
    // DÜZƏLİŞ: Advanced sistem funksiyasını istifadə et
    // QEYD: Advanced sistem artıq öz funksiyasını (AdvancedPressureControl_LoadPIDParamsFromFlash) çağırır
    // Bu, ikiqat Flash əməliyyatı riskini yaradır, amma uyğunluq üçün saxlanılır
    AdvancedPressureControl_SetPIDParams(&g_pid_zme, 
                                         g_pid_zme_tuning.kp, 
                                         g_pid_zme_tuning.ki, 
                                         g_pid_zme_tuning.kd);
    AdvancedPressureControl_SetPIDParams(&g_pid_drv, 
                                         g_pid_drv_tuning.kp, 
                                         g_pid_drv_tuning.ki, 
                                         g_pid_drv_tuning.kd);
    
    // Load and set SetPoint - DÜZƏLİŞ: Advanced sistem istifadə et
    if (config_data->setpoint > 0.1f && config_data->setpoint <= 300.0f) {
        AdvancedPressureControl_SetTargetPressure(config_data->setpoint);
        // REMOVED: pressure_limit sinxronizasiyası - artıq pressure_limit yoxdur
        printf("TARGET PRESSURE FLASH-DAN YÜKLƏNDİ: %.1f bar\r\n", config_data->setpoint);
    } else {
        // Flash-da etibarlı dəyər yoxdursa, default dəyəri istifadə et
        SystemStatus_t* status = AdvancedPressureControl_GetStatus();
        printf("FLASH-DA ETİBARLI TARGET PRESSURE YOXDUR, DEFAULT DƏYƏR İSTİFADƏ OLUNUR: %.1f bar\r\n", 
               status->target_pressure);
    }
    
    printf("PID parameters loaded: Kp=%.3f, Ki=%.3f, Kd=%.3f, SP=%.1f\r\n",
           config_data->pid_kp, config_data->pid_ki,
           config_data->pid_kd, config_data->setpoint);
}

/**
 * @brief Save calibration data to flash
 * 
 * KRİTİK DÜZƏLİŞ: Bu funksiya artıq mərkəzləşdirilmiş Flash yaddaş məntiqindən istifadə edir.
 * Bütün əl ilə bərpa məntiqi silindi.
 */
void PressureControlConfig_SaveCalibrationData(void) {
    printf("Saving calibration data to flash...\r\n");
    
    // Prepare calibration data structure
    typedef struct {
        uint32_t magic;           /* Magic number: 0x12345678 */
        float min_voltage;        /* 0.5V */
        float max_voltage;        /* 5.24V */
        float min_pressure;       /* 0.0 bar */
        float max_pressure;       /* 300.0 bar */
        uint16_t adc_min;         /* 410 */
        uint16_t adc_max;         /* 4096 */
        uint32_t checksum;         /* Data integrity check */
    } calibration_data_t;
    
    calibration_data_t cal_data;
    cal_data.magic = 0x12345678;
    cal_data.min_voltage = 0.5f;  // Default values, should be updated from g_calibration_data
    cal_data.max_voltage = 5.24f;
    cal_data.min_pressure = g_calibration_data.pressure_min;
    cal_data.max_pressure = g_calibration_data.pressure_max;
    cal_data.adc_min = (uint16_t)g_calibration_data.adc_min;
    cal_data.adc_max = (uint16_t)g_calibration_data.adc_max;
    
    // Calculate checksum
    uint32_t *min_v_ptr = (uint32_t*)&cal_data.min_voltage;
    uint32_t *max_v_ptr = (uint32_t*)&cal_data.max_voltage;
    uint32_t *min_p_ptr = (uint32_t*)&cal_data.min_pressure;
    uint32_t *max_p_ptr = (uint32_t*)&cal_data.max_pressure;
    cal_data.checksum = 0x12345678 ^ *min_v_ptr ^ *max_v_ptr ^ *min_p_ptr ^ *max_p_ptr ^ 
                       cal_data.adc_min ^ cal_data.adc_max;
    
    // KRİTİK DÜZƏLİŞ: Mərkəzləşdirilmiş Flash Yaddaş Məntiqindən istifadə et
    // block_type = 1 (Calibration)
    HAL_StatusTypeDef status = AdvancedPressureControl_SaveToFlash_Centralized(
        1,  // block_type: Calibration
        &cal_data,
        sizeof(calibration_data_t)
    );
    
    if (status == HAL_OK) {
        // Verify data was written correctly by reading it back
        calibration_data_t *verify_data = (calibration_data_t*)(0x080E0000 + 0x100);
        if (verify_data->magic == 0x12345678 && verify_data->checksum == cal_data.checksum) {
            printf("Calibration data saved and verified: ADC %d-%d, Pressure %.2f-%.2f bar\r\n",
                   cal_data.adc_min, cal_data.adc_max, cal_data.min_pressure, cal_data.max_pressure);
        } else {
            printf("ERROR: Calibration write verification failed!\r\n");
        }
    } else {
        printf("ERROR: Failed to save calibration data to flash!\r\n");
    }
}

/**
 * @brief Load calibration data from flash
 * 
 * KRİTİK DÜZƏLİŞ: Bu funksiya artıq Advanced sistemin vahid strukturundan istifadə edir.
 * Köhnə strukturlar (ADC 500-3500) silindi və AdvancedPressureControl_LoadCalibration() çağırılır.
 */
void PressureControlConfig_LoadCalibrationData(void) {
    printf("Loading calibration data from flash...\r\n");
    
    // KRİTİK DÜZƏLİŞ: Advanced sistemin vahid strukturundan istifadə et
    // Bu, köhnə strukturlar (ADC 500-3500) ilə yeni strukturlar (ADC 410-4096) arasında ziddiyyəti aradan qaldırır
    AdvancedPressureControl_LoadCalibration();
    
    // Advanced sistemdən yüklənən kalibrasiya məlumatlarını g_calibration_data strukturuna köçür
    extern CalibrationData_t g_calibration;  // advanced_pressure_control.c-dən (CalibrationData_t tipi)
    
    if (g_calibration.calibrated) {
        g_calibration_data.adc_min = g_calibration.adc_min;
        g_calibration_data.adc_max = g_calibration.adc_max;
        g_calibration_data.pressure_min = g_calibration.pressure_min;
        g_calibration_data.pressure_max = g_calibration.pressure_max;
        g_calibration_data.slope = g_calibration.slope;
        g_calibration_data.offset = g_calibration.offset;
        g_calibration_data.calibrated = true;
        
        printf("PressureControlConfig: Calibration loaded from Advanced system - ADC: %.0f-%.0f, Pressure: %.2f-%.2f bar\r\n",
               g_calibration_data.adc_min, g_calibration_data.adc_max, 
               g_calibration_data.pressure_min, g_calibration_data.pressure_max);
    } else {
        printf("No valid calibration data found, using defaults\r\n");
    }
    
    // Köhnə kod silindi - artıq Advanced sistemin vahid strukturundan istifadə edirik
}

/* =========================================================================
   MISSING FUNCTION IMPLEMENTATIONS
   ========================================================================= */

/**
 * @brief Backup configuration
 */
void PressureControlConfig_BackupConfiguration(void) {
    printf("Configuration backup - Starting...\r\n");
    
    // Save all configuration to flash
    PressureControlConfig_SaveToFlash();
    PressureControlConfig_SavePIDParams();
    PressureControlConfig_SaveCalibrationData();
    
    printf("Configuration backup - Complete\r\n");
}

/**
 * @brief Restore configuration
 */
void PressureControlConfig_RestoreConfiguration(void) {
    printf("Configuration restore - Starting...\r\n");
    
    // Load all configuration from flash
    PressureControlConfig_LoadFromFlash();
    PressureControlConfig_LoadPIDParams();
    PressureControlConfig_LoadCalibrationData();
    
    printf("Configuration restore - Complete\r\n");
}

/**
 * @brief Reset to defaults
 */
void PressureControlConfig_ResetToDefaults(void) {
    printf("Configuration reset to defaults - Starting...\r\n");
    
